from random import SystemRandom
import random

def toBinary(n):
    r = ''
    while n > 0:
        r=r+str(n % 2)
        n = n // 2
    r='1'+r+'1'   
    return int(str(r), base=2)
    
def CreatePrime(n): #Создание простого числа
    f = False
    while f==False:
        dp=random.randint(2**(n-1), 2**n) #Генерация последовательности
        dp2=toBinary(dp)      
        if Check(dp2)==False: #Проверка что р не делится на простые числа
            continue        
        if IsPrime(dp2, 5)==True: #Тест Миллера-Рабина
            f = True
    print(dp2)
    return dp2

def Check(p): #Проверка, что p не делится на простые числа в диапазоне [3; 3571]
    primes= [3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71,
            73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167, 173,
            179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241, 251, 257, 263, 269, 271, 277, 281,
            283, 293, 307, 311, 313, 317, 331, 337, 347, 349, 353, 359, 367, 373, 379, 383, 389, 397, 401, 409,
            419, 421, 431, 433, 439, 443, 449, 457, 461, 463, 467, 479, 487, 491, 499, 503, 509, 521, 523, 541,
            547, 557, 563, 569, 571, 577, 587, 593, 599, 601, 607, 613, 617, 619, 631, 641, 643, 647, 653, 659,
            661, 673, 677, 683, 691, 701, 709, 719, 727, 733, 739, 743, 751, 757, 761, 769, 773, 787, 797, 809,
            811, 821, 823, 827, 829, 839, 853, 857, 859, 863, 877, 881, 883, 887, 907, 911, 919, 929, 937, 941,
            947, 953, 967, 971, 977, 983, 991, 997, 1009, 1013, 1019, 1021, 1031, 1033, 1039, 1049, 1051, 1061, 1063, 1069,
            1087, 1091, 1093, 1097, 1103, 1109, 1117, 1123, 1129, 1151, 1153, 1163, 1171, 1181, 1187, 93, 1201, 1213, 1217, 1223,
            1229, 1231, 1237, 1249, 1259, 1277, 1279, 1283, 1289, 1291, 1297, 1301, 1303, 1307, 1319, 1321, 1327, 1361, 1367, 1373,
            1381, 1399, 1409, 1423, 1427, 1429, 1433, 1439, 1447, 1451, 1453, 1459, 1471, 1481, 1483, 1487, 1489, 1493, 1499, 1511,
            1523, 1531, 1543, 1549, 1553, 1559, 1567, 1571, 1579, 1583, 1597, 1601, 1607, 1609, 1613, 1619, 1621, 1627, 1637, 1657,
            1663, 1667, 1669, 1693, 1697, 1699, 1709, 1721, 1723, 1733, 1741, 1747, 1753, 1759, 1777, 1783, 1787, 1789, 1801, 1811,
            1823, 1831, 1847, 1861, 1867, 1871, 1873, 1877, 1879, 1889, 1901, 1907, 1913, 1931, 1933, 1949, 1951, 1973, 1979, 1987,
            1993, 1997, 1999, 2003, 2011, 2017, 2027, 2029, 2039, 2053, 2063, 2069, 2081, 2083, 2087, 2089, 2099, 2111, 2113, 2129,
            2131, 2137, 2141, 2143, 2153, 2161, 2179, 2203, 2207, 2213, 2221, 2237, 2239, 2243, 2251, 2267, 2269, 2273, 2281, 2287,
            2293, 2297, 2309, 2311, 2333, 2339, 2341, 2347, 2351, 2357, 2371, 2377, 2381, 2383, 2389, 2393, 2399, 2411, 2417, 2423,
            2437, 2441, 2447, 2459, 2467, 2473, 2477, 2503, 2521, 2531, 2539, 2543, 2549, 2551, 2557, 2579, 2591, 2593, 2609, 2617,
            2621, 2753, 2767, 2777, 2789, 2791, 2797, 2801, 2803, 2819, 2833, 2837, 2843, 2851, 2857, 2861, 2879, 2887, 2897, 2903,
            2909, 2917, 2927, 2939, 2953, 2957, 2963, 2969, 2971, 2999, 3001]
    f = True
    for i in primes:
        if p % i == 0:
            f = False            
            break
    #print("p=",p)
    return f

def IsPrime(p, iterations):
    if(p<=2):
        return False
    p2 = p-1 
    b = 0
    while p2 % 2 == 0: #Вычисление b
        p2= p2 / 2
        b=b+1
    
    m = (p-1) // (2**b) #Вычисление m
    for i in range(0, iterations):
        c = SystemRandom()
        a = c.randrange(2, p-2) #Вычисление а
        j = 0
        z = a**m % p #Вычисление z
        if (z==1 or z==p-1):
            continue
        for k in range (0, b-1):
            z = (z*z) % p
            if (z == 1):
                return False
            if (z == p-1): #Продолжить цикл А
                break
            return False
        
    return True

def GetRoot(p):
    for i in range(0, p):
        if IsRoot(p, i)==True:
            return i
    return 0;

def IsRoot(p, a):
    if a==0 or a==1:
        return False
    last = 1
    s = set()
    for i in range(0, p-1):
        last = (last * a) % p
        if last in s:
            #print(last)
            return False
        s.add(last)
    return True

Prime=CreatePrime(17)
print('Prime=',Prime)
q=GetRoot(Prime)
print("q=",q)
X_a=random.randint(1, Prime-1)
X_b=random.randint(1, Prime-1)
#Записать в файл Х_а
with open("textfile.txt",'w', encoding='utf-8') as file:
    print('Alice sent ',X_a)
    file.write(str(X_a))
    file.close()
    
#Считать из файла X_a
with open("textfile.txt", 'r', encoding='utf-8') as file:
    #print("X_a=",int(file.read()))
    Fr1=int(file.read())
    Y_a=q**Fr1 % Prime
    print('Bob got ',Fr1)
   
#Записать в файл X_b 
with open("textfile.txt",'w', encoding='utf-8') as file:
    print('Bob sent ',X_b)
    file.write(str(X_b))

#Cчитать из файла X_b
with open("textfile.txt", 'r', encoding='utf-8') as file:
    Fr2=int(file.read())
    Y_b=q**Fr2 % Prime
    print('Alice got ',Fr2)
    
#Вычислить K_a
K_a=Y_b**X_a % Prime

#Вычислить K_b
K_b=Y_a**X_b % Prime

print(K_a,"++++",K_b)